bat
chafa
cmake
codespell
coreutils
direnv
eza
fd
fish
fisher
fzf
gcc
gettext
git
git-delta
gnupg
gnu-sed
go
grc
imagemagick
jq
lazygit
luarocks
make
ncdu
neofetch
neovim
ngrep
python
readline
ripgrep
starship
stow
tealdeer
telnet
tig
tmux
tree
vim
wget
zsh
