bat
cmake
codespell
coreutils
deno
eslint
eza
fd
fish
fisher
flake8
fzf
gcc
gettext
git
git-delta
gnupg
go
jq
lazygit
libunistring
make
neofetch
neovim
netcat
ngrep
npm
python
python-pip
readline
ripgrep
shellcheck
shfmt
starship
stylua
tmux
tree
unzip
vim
wezterm
wget
