bat
cmake
doas
eza
fd
fish
fzf
gcc
gettext
git
delta
gnupg
go
jq
lazygit
libunistring
make
ncdu
netcat-openbsd
npm
pkgconfig
python3
readline
ripgrep
rust
stow
tig
tmux
tree
unzip
vim
wget
