bat
cmake
codespell
coreutils
eza
fd
fish
fzf
gcc
gettext
git
git-delta
gnupg
go
imagemagick
ipython
jq
lazygit
libunistring
lua51
luarocks
make
netcat
npm
pkgconfig
python
python-ipykernel
python-jupyter-client
python-neovim
python-pillow
python-pip
python-pipx
python-pynvim
readline
ripgrep
rust
stow
tig
tmux
tree
unzip
wget
