bat
build-essentials
chafa
clang
cmake
direnv
eza
fd-find
fish
fzf
fonts-jetbrains-mono
gcc
git
git-delta
gnupg
golang
grc
imagemagick
jq
luarocks
make
ncdu
ngrep
npm
nodejs
ripgrep
starship
stow
tealdeer
telnet
tig
tmux
tree
vim
wget
zsh
