bat
cmake
codespell
coreutils
eza
fd
fish
fzf
gcc
gettext
git
git-delta
gnupg
go
imagemagick
jq
libunistring
luarocks
make
neofetch
neovim
netcat
ngrep
npm
python
python-pip
readline
ripgrep
stow
tmux
tree
unzip
wget
