bat
black
codespell
coreutils
eslint
exa
fd
fish
fisher
flake8
fzf
gcc
gettext
git
git-delta
gnu-sed
gnupg
go
grc
jq
lazygit
make
neofetch
neovim
ngrep
nvm
prettier
python
ranger
readline
ripgrep
shellcheck
shfmt
starship
stylua
tealdeer
telnet
tmux
tree
vim
wget
zsh
